# Working with different file formats (csv, xml, json, xlsx)

In [5]:
#import 
import pandas as pd

url ='https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/addresses.csv'

df = pd.read_csv(url,header=None)
df.to_csv("flieexample.csv")

In [13]:
file="flieexample.csv"
df=pd.read_csv(file )
df.head()

,Unnamed: 0,0,1,2,3,4,5
0,0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,4,NaN,Blankman,NaN,SomeTown,SD,298

In [21]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [22]:
df.columns =['First Name', 'Last Name', 'Location ', 'City','State','Area Code']

In [23]:
df.head()

,First Name,Last Name,Location,City,State,Area Code
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298

In [24]:
###########################################

In [26]:
import json